Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Student_Conv1a (QConv2D)     (None, 7, 14, 6)          60        
_________________________________________________________________
q_activation (QActivation)   (None, 7, 14, 6)          0         
_________________________________________________________________
Student_Conv1b (QConv2D)     (None, 5, 12, 6)          330       
_________________________________________________________________
q_activation_1 (QActivation) (None, 5, 12, 6)          0         
_________________________________________________________________
Student_Conv2a (QConv2D)     (None, 3, 10, 6)          330       
_________________________________________________________________
q_activation_2 (QActivation) (None, 3, 10, 6)          0         
_________________________________________________________________
Student_Conv2b (QConv2D)     (None, 1, 8, 6)           330       
_________________________________________________________________
q_activation_3 (QActivation) (None, 1, 8, 6)           0         
_________________________________________________________________
flatten (Flatten)            (None, 48)                0         
_________________________________________________________________
fc1 (QDense)                 (None, 10)                490       
_________________________________________________________________
relu1 (QActivation)          (None, 10)                0         
_________________________________________________________________
fc2 (QDense)                 (None, 10)                110       
_________________________________________________________________
relu2 (QActivation)          (None, 10)                0         
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 1,672
Trainable params: 1,672
Non-trainable params: 0
_________________________________________________________________
